// 1) ახსენით როგორ გესმით ტერმიენბი lexical scope და hoisting, დაწერეთ რა გასნხვავებაა var-ითა და let-ით შექმნილ ცვლადებს შორის მოიყვანეთ ყველაფრის მაგალითები

// var ქეივორდის მეშვეობიდ ვქმნით გლობალურ ცვლადს, ისარის ყველგან ხელმისაწვდომი
// let ქეივორდი შეგიძლია გამოიყენო იმ ბლოკში სადაც შეიქმნა ან მის ქვემოთ
// hosting ჯავასკრიფტის თვისებაა რომელიც ყველა ფუნქციის ინიციალიზაციას ახდენს რაიმის გაშვების დაწყებამდე
// lexical scope კოდის ბლოკში და მის ქვემოთ კონკრეტული მნიშვნელობის ხელმისაწვდომობა