// 1) დაწერეთ რა არის პრიმიტიული და კომპლექსური მნიშვნელობები, ასევე თქვენი სიტყვებით ახსენით რა არის stack & heap მეხსიერებები მოიყვანეთ მაგალითი თითოეულზე. საბოლოოდ დაწერეთ რა არის memory leak და აიღეთ ერთ-ერთი მაგალითი (არ გაუშავთ)

// primitive მნიშვნელობებია: number,string,boolean
// complex მნიშვნელობებია:function,object,array

// steack არის მეხსიერების ტიპი სადაც ინახება მარტივი და პრიმიტიული ტიპები ხოლო heap არის რთული დიდი და კომპლექსური ტიპებისთვის განკუთვნილი მეხსიეერება 

// memory leak მაგალითი

function task(){
    task()
}
task()