"""4) აიღეთ 3 ცვლადი, შეინახეთ განსხავებული მონაცემთა ტიპები (str,int,float), შემდეგ type ინსტრუქციის გამოყენებით შეამოწმეთ, თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი."""

#შევქმენი სამი სხვადასხვა ტიპის ცვლადი
value_1 = "apple"
value_2 = 14
value_3 = 67.89

#type ფუნქციით ვიგებ შექმნილი ცვლადების ტიპებს
type_value_1 = type(value_1)
type_value_2 = type(value_2)
type_value_3 = type(value_3)

#დავპრინტე ტიპების გასაგებად შექმნილი ცვლადები რათა გამეგო პირველად შექმნილი ცვლადების ტიპები
print(type_value_1)
print(type_value_2)
print(type_value_3)