"""1) შექმენით სია რომელშიც ჩამოწერეთ თქვენთვის სასურველი ელემენტები, მინიმუმ 10

indexing
გამოიტანეთ სიაში არსებული მესამე ელემენტი
ჩაანაცვლეთ სიაში არსებული პირველი ელემენტი
slicing
დაბეჭდეთ 2-დან მე-5 ელემენტამდე
დაბეჭდეთ მეორე ელემენტიდან ყველა ელემენტი
დაბეჭდეთ მეხუთე ელემენტამდე ყვეალფერი
დაბეჭდეთ სია შემობრუნებულად"""

cars = ["mercedes","audi","bmw","shewrolet","wolksvagen","porshe","mazda","fiat","mini cooper"]

print(cars[2])

cars[0] = "mitsubishi"

print(cars[1:4])

print(cars[1:10])

print(cars[4:10])

print(cars[::-1])