// 3) დაწერეთ მაგალითი სადაც გამოყენებული იქნება var, let და const ცვლადები. კომენტარებით ახსენით რით განსხვავდებიან ისინი ერთმანეთისგან და როგორია მათი მოქმედების არეალი: გლობალური, ლოკალური (ფუნქციის) და ბლოკის ფარგლები. აგრეთვე შექმენით მაგალითი ლექსიკური ფარგლების მუშაობისას და კომენტარებით ახსენით რას ნიშნავს ლექსიკური ფარგლები და როგორ მუშაობს ცვლადების ხილვადობა შიდა და გარე ფუნქციებში

var x = 1;
let y = 2;
let b = 3;
// სამივე ცვლადი განსხვავდება ერთმანეთისგან იმით რომ პირველი ცვლადი არის var ით შექმნილი ცვლადი და მას აქვს გლობალური სცოუპი რითაც მას შეგვიძლია მივწვდეთ ყელა კოდის ბლოკში მეორე და მესამე ერთმანეთისგან განსხვავდებიან ერთი რაღცით const - ით შექმნილი ცვლადის მნიშვნელობის შეცვლა შეუძლებელია ხოლო ერთნაერი თვისებებია მათი სკოუპია კოდის ბლოკში და მისქვემოთ გამოყენებადობა 


function greet() {
    let p = 4;
}

p = 5

// ამასქვია lexical scope და ნიშნავს იმას რომ ცვლადის გამოენება შეიძლბა თვის კოდის ბლოკში და ის ქვემოთ 