// 2) ახსენით რა არის პრიმიტიული და კომპლექსური მონაცემთა ტიპები, stack & heap მეხსიერება, მოიყვანეთ მაგალითები და გააკეთეთ ნახაზი

// primitive მნიშვნელობებია: number,string,boolean
// complex მნიშვნელობებია:function,object,array

// steack არის მეხსიერების ტიპი სადაც ინახება მარტივი და პრიმიტიული ტიპები ხოლო heap არის რთული დიდი და კომპლექსური ტიპებისთვის განკუთვნილი მეხსიეერება 

// steack ინახავს ისეთ ელემენტებს როგორიცაა ცვლადი
let name = "beqa";

// ხოლო heap ინახავს მასივებს ობიექტებს და ფუნქციებს
let array = [1,2,3,4,5,6];
