""" მომხმარებელს შემოატანინეთ თავისი სახელი, გვარი, ასაკი და ქალაქი. შემდეგ ეს ინფორმაცია ერთ წინადადებად დაუბეჭდეთ ტერმინალში"""

#შევქმენი ცვლადი full_name და input-ის მეშვეობით მომხმარებელს გამოვატანინე თავისი სახელი
full_name = input("ჩაწერე შენი სახელი და გვარი:")

#შევქმენი ცვლადი age და input-ის მეშვეობით მომხმარებელს გამოვატანინე თავისი ასაკი
age = input("ჩაწერე შენი ასაკი:")

#შევქმენი ცვლადი your_location და input-ის მეშვეობით მომხმარებელს გამოვატანინე თავისი საცხოვრებელი ადგილი
your_location = input("ჩაწერე შენი საცხოვრებელი ადგილი:")

#მოხმარებელს თავისი შემოტანილი ინფორმაცია გრეწილი წინადადებით დავბეჭდე ტერმინალში
print("გამარჯობა " + full_name + " როგორც თქვი შენ ხარ " + age + " წლის და ცხოვრობ " + your_location +"ში" )














