""" თითოეულ მათემატიკურ ოპერატორზე (+, -, *, /, %, **, //) შეასრულეთ 5 მაგალითი და დაბეჭდეთ შედეგი"""
#მიმატება
print(35 + 45)
print(367 + 179)
print(863 + 183)
print(9 + 19)
print(7834 + 4577)


#გაამოკლება
print(25 - 7)
print(855 - 9)
print( 5 - 6)
print(5892 - 6734)
print(904 - 435)

#გამრავლება
print(346 * 348)
print(20 * 15)
print(65 * 81)
print(18 * 18)
print(3282 * 438)

#გაყოფა
print(8888 / 9)
print(423 / 4)
print(277 / 10)
print(37 / 3)
print(56 / 7)

#ნაშთი
print(8888 % 8)
print(420 % 4)
print(278 % 10)
print(37 % 3)
print(56 % 7)

#ხარისხები
print(67 ** 7)
print(43 ** 4)
print(78 ** 2)
print(23 ** 3)
print(32 ** 5)

#წილადები
print(6 // 3)
print(77 // 14)
print(65 //32 )
print(44 // 32)
print(65 // 3)