""" შექმენით ცვლადი სახელად celsius სადაც შეინახავთ მთელ რიცხვს. შემდეგ შექმენით ცვლადი სახელად fahrenheit, სადაც უნდა
გამოთვალოთ წინა ცვლადის ტემპერატურა რამდენი ფაერენჰეიტი იქნება. ასევე შექმენით ცვლადი kelvin რომელშიც შეინახავთ თუ რამდენი
კელვინი იქნება celsius ცვლადში მოცემული რიცხვი, საბოლოოდ დაბეჭდეთ სამივე ცვლადი"""

#შევქმენი ცვლადი celsius-ი და მივანიჭე მნიშვნელობა -3
celsius = -3
#შევქმენი ცვლადი fahrenheit-ი და გამოვითვალე
fahrenheit = (celsius * 9/5) + 32
#შევქმენი ცვლადი kelvin-ი და გამოვითვალე
kelvin = celsius + 273.15

#დავპრინტე შექმნილი ცვლადები
print(celsius)
print(fahrenheit)
print(kelvin)