"""3) შექმენით list, tuple და set. კომენტარებით დაწერეთ თითოეულის თვისება და ყველა თვისებიდან მოიყვანეთ მაგალითები"""

#list არის immutable რაც ნიშნავს იმას რომ შეიძლება ელემენტები ამოვაკლოთ დავამატოთ და შევინახოთ სხვადასხვა ტიპის ელემენტები
list1 = [1,2,3,4,5,6,7]

#tuple არის ისა რომლის შეცვლაც შექმნის შემდეგ შეუძლებელია
tuple1 = (1,2,3,4,5,6,7)

#set არის წყობა რომელსაც არ გააჩნია ინდექსები ასევე დაპრინტვის დროს გამოდის არეული თანმიმდევრობით და არ აჩვენებს დუბლიკატებს
set1 = {1,2,3,4,5,6,7}


