// 2) შექმენით თარიღის ობიექტი, რომელშიც შეინახავთ 2023 წლის სექტემბერის 5 რიცხვს. ამისთვის გადაეცით date ობიექტის სტირნგის სახით თარიღი, კომენტარებით დაწერთ კიდევ როგორ შეიძლება date ობიექტს გადავცეთ თარიღი და თუ არ გადავცემთ არგუმენტს რა მოხდება. შექმნილი date ობიექტი შეინახეთ hireDate ცვლადში და ცალცალკე კონსოლში გამოიტანეთ წელი, თვე, რიცხვი, კვირის დღე, საათები, წუთები და წამები


let hireDate = new Date("2023-09-05")

// თუ გადავცემთ მხოლოდ ერთ არგუმენტს მაშინ ეს არგუმენტი უნდა იყოს სტრინგი ხოლო თუ გადავცემთ ერთზე მეტს უნდა იყოს რიცხვი არგუმენტებია 
// 1.წელი
// 2.თვე
// 3.რიცხვი
// 4.საათი
// 5.წუთი
// 6.წამი
// 7.მილიწამი
// თუ არგუმენტად არაფერს გადავცემთ მაშინ გვიჩვენებს ეხლანდელ დროს

console.log(hireDate.getFullYear());
console.log(hireDate.getMonth());
console.log(hireDate.getDate());
console.log(hireDate.getDay());
console.log(hireDate.getHours());
console.log(hireDate.getMinutes());
console.log(hireDate.getSeconds());