"""3) შექმენით 5 ცვლადი, რომლებშიც შეინახავთ განსხვავებულ შედარების ოპერაციათა შედეგებს, შედარების ოპერაციას გვერდზე კომენტარის საშვალებით მიუწერეთ მისი შედეგი (boolean მნიშვნელობა) და ახსენით რა განსხვავებაა ოპერატორსა და ოპერაციას შორის"""

operation1 = 5 > 6 #False
operation2 = 7 < 5 #False
operation3 = 99 > 3 #True
operation4 = 3 < 4 #True
operation5 = 6 > 5 #True

#ოპერატორი არის მაგალითად მიმატება გამიკლება და ასე შემდეგ ხოლო ოპერაცია არის ოპერატორით შესრულებული მაგალითი 
#მაგალითად
operation = 1 + 1 # ეს ყველაფერი მთლიანად არის ოპერაცია რომელიც ოპერატორიტ სრულდება 

