// 3) შექმენით ფუნქცია sumAll რომელიც იღებს ნებისმიერ რაოდენობის რიცხვს rest ოპერატორის გამოყენებით შემდეგ დაითვალეთ ამ რიცხვების ჯამი და დააბრუნეთ შედეგი მაგალითზე გამოიძახეთ ფუნქცია სხვადასხვა რაოდენობის არგუმენტით და კომენტარებით ახსენით რას აკეთებს rest ოპერატორი

let sumAll = (...rest) => {
    let num = 0;
    for (let i of rest){
        num+=i
    }
    return num
}

// rest იღებს ნებისმიერი რაოდენობის ელემენტს და თითოეულზე ცალკე დაწერის მაგივრად ის გაგვიადვილებს საქმეს და ყველა ელემენტს ერთად მოაქცევს