// 3) ყველა ახალ ნასწავლი მეთოდზე გააკეთეთ 2-2 მაგალითი და ახსენით კომენტარებით თქვენი სიტყვებით თუ რას აკეთებს  თითოეული მეთოდი (push,pop,unshift,shift, slice, splice)


let arr = [1,2,3,4,5,6,7,8,9,10]
// push ამატებს ჩვენს გადაცემულ ელემენტს სიაში ბოლო ადგილზე

arr.push(12);
arr.push(13);

// pop - სიიდან შლის ბოლო ინდექსზე მყოფ ელემენტს

arr.pop();
arr.pop();

// unshift -  მეთოდი ჩვენგან გადაცემულ ელემენტს ატენებს სიის პირველ ადგილას და სიაში მყოფებს წევს ერთი ინდექსით წინ

arr.unshift(0);
arr.unshift(-1);

// shift - მეთოდი შლის სიის პირველ ელემენტს და სიაში მყოფი ელემენტებს წევს ერთი ინდექსით უკან

arr.shift();
arr.shift();

// slice - მეთოდი ჩვენი გადაცემული ინდექსის მიხედვით ჭრის ელემენტებს სიიდან ისე რომ სია არ იცვლება და ელემენტები რჩება ის გამოიყენება ახალი სიის შესაქმნელად

let arr1 = arr.slice(3,5);
let arr2 = arr.slice(0,4);

// splice - აკეთებს იგივეს რასაც slice ოღონდ მის შემთხვევაში ჩვენი გადაცემული მონაკვეთი იშლება სიიდან

arr.splice(0,2);
arr.splice(0,3);