"""4) შექმენით dictionary სახელად student, დაამატეთ მას მონაცემები: name, hobby, height, weight. შემდეგ გამოიყენეთ .get() მეთოდი name-ის მისაღებად და .pop() მეთოდი height-ის წასაშლელად. დაუმატეთ კომენტარები, რას აკეთებს თითოეული მეთოდი"""

dictionary = {
    "name" : "beqa",
    "hobby" : "football",
    "height" : 1.60,
    "weight" : 57.800
}

#get ფუნქციას ვიყენებთ როცა გვინდა მივწვდეთმ რაიმე მნიშვნელობას გადავცემთ თავის key-ს და დაგვიბრუნებს value
print(dictionary.get("name"))

#pop - მეთოდს ვიყენებთ როცა გვინდა რაიმე ელემენტის ამოკლება გადავცემთ ელემენტის kay-ს და ის ამოაკლდება
dictionary.pop("height")