"""2) მომხმარებელს input-ის საშვალებით შემოტანინეთ ორი რიცხვი number1 და
number2 შემდეგ კი დაბეჭდეთ მათი ჯამი. ასევე შექმენით level-ის ცვლადი რომელშიც მომხამრებელს შემოაყვანინებთ მათ ამჟამინდელ
level-ს, შეეცადეთ level-ის მნიშვნელობას დაუმატოთ ერთი და ისე დაბეჭდოთ. მიღებული შედეგებით გამოიტანეთ დასკვნა და დაწერეთ
კომენტარებით"""


num1 = input("enter any number: ")
num2 = input("enter any number: ")

print(num1 + num2)

level = input("enter your level: ")

print(level + 1)

#ამ შემთხვევაში მათემატიკური ამოცანა ვერ მოხტება რადგან input-ში ყველაფერი თავდაპირველად არის stringi ხოლო stringi არის სიმბოლოები და სიბოლოებით მათემატიკური ამოცანა ვერ მოხერხდება