// 3) შექმენით ნებისმიერ ფუნქცია, რომელსაც გამოიძახებთ ყოველ 3 წამში ერთხელ, შემდეგ ეს ისტრუქცია დააკომენტარეთ და ფუნქცია გამოძახეთ ერთხელ ინსტრუქციის წაკითხვიდან 4 წამის შემდეგ, კომენტარებით ახსენით როგორ მუშაობს setInterval და setTimeout ფუნქციები


function greet(){
    console.log("hello world")
}


// setInterval(greet, 3000) 

// setinterval ჩვენ გადაცემულ ფუნქციას გაუშვებს იმდენი წამის დაშორებებით რამდენსაც ჩვენ გადავცემთ

setTimeout(greet,4000)

// settimeout გაუშვებს იმდენხნიანი პაუზის შემდეგ რამდენსაც ჩვენ გადავცემთ