"""2) შექმენით ცივი სასმელების სია აქედან ერთ-ერთი ელემენტი უნდა ეწეროს ცვლადის სახით, შემდეგ მომხმარებელს შემოტანინეთ 1 ცივი სასმელი რომელსაც დაამატებთ თქვენს მაცივარში. შემდეგ მომხარებელს უნდა შემოატანინოთ არჩევანი ამ სასმელებიდან და სიიდან ელემენტის წამოღების indexing method-ის საშვალებით გამოუტანეთ ეს სასმელი. შექმენით ცვლადი რომელშიც შეინახავთ თქვენს სახელს, გამოიტანეთ ამ სტრინგიდან თქვენთვის სასურველი 3 სიმბოლო"""

soda = "coca-cola"

market =["orange juice","fanta",soda]

juice = input("enter your favorite juice: ")

market += juice

index = int(input("enter your opinion: "))

print(market[index])

name = "beqa"

print(name[0])
print(name[1])
print(name[3])