"""1) შექმენით mybalance-ის ცვლადი, შემდეგ გაზარდეთ ამ ცვლადის მნიშვნელობა 2-თ უბრალო ფორმით, შემდეგ ისევ გაზარდეთ მნიშვნელობა
 3-ით ოღონდ გამოიყენეთ assigment operator, ამის შემდეგ თქვენი სურვილისამებრ შეცვალეთ ცვლადის მნიშვნელობა იგივე assingment operator-ის
 საშვალებით, კოდი ახსენით კომენატრებით, ჩამოწერეთ ყველა საუკეტესო პრაქტიკა და მიუწერეთ განმარტებები"""

#შევქმენი ცვლადი my_balance მივანიჭე მნიშვნელობა 0
my_balance = 0
print(my_balance)

# ცვლად my_balance-ს დავუმატე 2 ჩვეულებრივი გზით და დავპრინტე
my_balance = my_balance + 2
print(my_balance)

# ცვლად my_balance-ს დავუმატე 2 assigment operator-ით და დავპრინტე
my_balance += 3
print(my_balance)

# ცვლად my_balance-ს შევუცვალე ჩენთვის სასურველი მნიშვნელობა assigment operator-ით და დავპრინტე
my_balance += 5
print(my_balance)

#საუკეთესო პრაქტიკაა დაშორების მაგივრად snake case-ის გამოყენება რადგან ცვლადის სახელებს შორის არ შეიძლება გამოვიყენოთ space
#ასევე საუკეთესო პრაქტიკაა კომენტარის გამოყენება რადგან ის გვეხმარება ადვილად გავიგოთ კოდის განმარტება 
