""" გააკეთეთ პროგრამა რომელშიც გექნებათ ცვლდი სადაც შეინახავთ თქვენს hobby-ის, ასევე შექმენით string ტიპის ცვლადი რომელშიც შეინახვათ თქვენთვის სასურველ მესიჯს, შემდეგ ეს ორი ტექსტი დაბეჭდეთ ერთად, ასევე აიღეთ 2 integer ტიპის ცვლადი და დაბეჭდეთ მათი შეკრებაც, თქვენი სიტყვებით ახსენით რა განსხვავებაა ამ ორი სხვადასხვა ტიპის ცვლადების დამატების ოპერაციებს შორის, რა ეწოდება თითოეულ მოვლენას"""
#შევქმენი ცვლადი და შევასრულე კონკადინაცია რაც ნიშნავს ორი სტრინგის შეერთებასს
my_hobby = "fexburtis tamashi"
print("me miyvars " + my_hobby)

#ორი integer-ი დავუმატე ერთმანეთს და შევასრულე მათემატიკური ამოცანა
print(5 + 10)

# ამ ორ მოვლენას შორის განსხვავება არის ის რომ ინტეჯერების ერთმანეთზე შესლუდა კონკადინაცია
# ხოლო ინტეჯერების ერთმანეტზე მიმატებით შესრულდა მათემატიკური ამოცანა