"""5) მომხმარებელს შემოატანინეთ თავისი ასაკი, შემდეგ შემოატანინეთ წლების რაოდენობა. მიღებული ინფორმაცია შეინახეთ ცვლადებში და
გამოითვალეთ, რამდენი წლის იქნება მომხმარებელი y (მომხმარებლის მიერ შემოტანილი) წლის შემდეგ. საბოლოოდ გამოუტანეთ შედეგი
შემდეგი სახით: "[წლები] წლის შემდეგ თქვენ იქნებით [მომავალი ასაკი] წლის". დავალების შესასრულებლად გამოიყენეთ მონაცემთა 
ტიპების ხელოვნურად შეცვლის მეთოდები: int() - რომ შეასრულოთ ართიმეტიკული მოქმედებები, str() - რომ დაბეჭდოთ შედეგი 
შეცდომების გარეშე"""

#მომმარებელს input ფუნქციის საშვალებით შემოვატანინე თავისი ასაკი
age = int(input("enter your age: "))

#მომხმარებელს input ფუნქციის საშვალებით შემოვატანინე წლების რაოდენობა
years = int(input("enter years quantity: "))

resoult = age + years

print("you are " + str(age) + " years old, in " + str(years) + " years you will be " + str(resoult) )