"""2) შექმენით 5 ცვლადი რომლებშიც შეინახავთ წიგნების თავდაპირველ ფასს, შემდეგ შექმენით ცვლადი რომელშიც შეინახავთ ფასდაკლების 
ოდენობას, შექმენით ახალი ფასის მქონე წიგნების ცვლადები, რომელთა მნიშვნელობა იქნება ძველ მნიშვნელობას გამოკლებული ახალი, საბოლოოდ 
კი დაბეჭდეთ ახალი წიგნების ფასები (გამოიყენეთ კარგი მიდგომები: რომ ცვლადის მნიშვნელობის მინიჭებისას შეგიძლიათ სხვა ცვლადის გამოყენება, 
კოდი ახსენით კომენტარების საშვალებით, ცვლადებს დაარქვით აღმწერი სახელები snake_case-ის სტილში)"""

#შევქმენი რამოდენიმე ცვლადი და დავარქვი სახელად (book1,book2,...,book5) და ცვლადს მნიშვნელობა მივანიჭე 70 იგივე წიგნის ფასი
book_1 = 70
book_2 = 60
book_3 = 75
book_4 = 80
book_5 = 105

#შევქმენი ფასდაკლების ცვლადი სახელად discount და მივანიჭე მნიშვნელობად 35
discount = 35 

#შევქმენი წიგნების ფასდაკლებული ვერსიის ცვლადები 
discounted_book1 = book_1 - discount
discounted_book2 = book_2 - discount
discounted_book3 = book_3 - discount
discounted_book4 = book_4 - discount
discounted_book5 = book_5 - discount

#შევქმენი ახალი ცვლადები და მათ მნიშვნელობასი ჩავწერე ძველი წიგნების ფასზე გამოკლებული ფასდაკლებული წიგნების ფასი
new_book1 = book_1 - discounted_book1  
new_book2 = book_2 - discounted_book2 
new_book3 = book_3 - discounted_book3 
new_book4 = book_4 - discounted_book4
new_book5 = book_5 - discounted_book5

#დავპრინტე ახალი წიგნების ცვლადების მნიშვნელობები
print(new_book1)
print(new_book2)
print(new_book3)
print(new_book4)
print(new_book5)
