// 2) ახსენით რა განსხვავებაა სინქრონულ და ასინქორნულ კოდს შორის, მოყივანეთ მაგალითები რეალური ცხოვერბიდან და პროგრამიდან

// სინქრონული კოდი არის მაგალითად როდესაც გადაცემული არის რაიმე ორი დავალება სანამ პირველი არშესრულდება მეორეს შესრულება ვერდაიწყება ხოლო ასინქრონული პირიქით
// თუ ერთი დავალების შესრულება გვიანდება პირველის შესრულებამდე გადადის მეორეზე
// მაგალითად მაქვს ფაილი ჩამოსატვირთი და ჩანაწერი სანახი თუ ვიმოქმედებ ასინქრონულად ფაილს დავაწყებინებ ჩამოტვირთვას არ დაველოდები დასრულებას და გადავალ ჩანაწერზე ხოლო თუ ვიმოქმედებ სინქრონულად დაველოდები ფაილის ჩამოტვირთვას და შემდეგ ვუყუყრებ ჩანაწერს