"""2) დაწერეთ რა არის ფუნქცია, რისთვის ვიყენებთ, რამდენი ტიპის არსებობს, რა არის პარამეტრები, არგუმენტები და დაბრუნება (return)"""

"""  ფუნქცია არის კოდი რომლითაც  კონკრეტული მოქმედება  სრულდება, მას გააჩნია სახელი  ის შეიძლება გამოვიყენოთ ერთხელ  ან მრავალჯერ,
კოდის სხვადასხვა ადგილას, მას ვიყენებთ კოდის გასაუმჯობესებლათ და იმისთვის რომ კოდი უფრო შევამოკლოთ ასევე ის გვეხმარება
დიდი პროექტებისდროს სამუშაოს გაუმჯობესებაში ის არის სამი ტიპის,
პარამეტრი ეწოდება ცვლადის სახელს, რომელიც ფუნქციის განსაზღვრისას წერია.
არგუმენტი არის  მნიშვნელობა, რომელსაც ფუნქციას ვუგზავნით გამოძახებისას.
return  გამოიყენება იმისთვის რომ ფუნქციამ მნიშვნელობა დააბრუნოს."""