"""3) განხილულ მეთოდებზე: split, join, replace, strip მოიყვანეთ 2-2 მაგალითი.
 თითოეულს მიუწერეთ კომენტარებით ახსნა თუ როგორ მუშაობს"""

# split
num = "1 2 3 4"
print(num.split())
print(num.split(","))

# join
print(",".join(num))
print("asvhg".join(num))

# replace
print(num.replace(1,3))
print(num.replace(2,5))

# strip 
print(num.strip(","))
print(num.strip(" "))
"""split - არის string მეთდი რომელიც სიას გაყოფოს კონკრეტულ სიმბოლებზე (რასაც გადავცემთ არგუმენტად), თუ არგუმენტი არ გადავეცით ის default-ად string-ს space-ებზე და წაშლის ყველა ზედმეტ space-ს, join - string-ის მეთოდი, რომელსაც არგუმენტად გადაეცემა სია, ეს მეთოდი სიაში მყოფ ელემენტს შეართებს სტრინგად და თითოეულს შორის ჩასვამს იმ სტრინგს რომელზეც გამოვიყენეთ ეს მეთოდი, replace - string-ის მეთოდი, რომელიც გამოძახებულ string-ის ყველა პირველ პარამეტრის მნიშვნელობას შეცვლის მეორეთი, strip - string-ის მეთოდი, რომელიც ბოლოს დარჩენილ space-ებს წაშლის"""

